-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: webpagesdb.it.auth.gr:3306
-- Generation Time: Jul 13, 2020 at 07:32 PM
-- Server version: 5.5.62-0ubuntu0.14.04.1
-- PHP Version: 7.1.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `Chatbot`
--

-- --------------------------------------------------------

--
-- Table structure for table `Amphitheatres`
--

CREATE TABLE `Amphitheatres` (
  `Name` tinytext NOT NULL,
  `Location` enum('Ημιώροφος Πληροφορικής ΑΠΘ','Παράρτημα Καλαμαριάς Τμήματος Πληροφορικής') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `Amphitheatres`
--

INSERT INTO `Amphitheatres` (`Name`, `Location`) VALUES
('Η3', 'Ημιώροφος Πληροφορικής ΑΠΘ'),
('ΕΑ3', 'Παράρτημα Καλαμαριάς Τμήματος Πληροφορικής'),
('ΕΑ4', 'Παράρτημα Καλαμαριάς Τμήματος Πληροφορικής');

-- --------------------------------------------------------

--
-- Table structure for table `Contact`
--

CREATE TABLE `Contact` (
  `Type` tinytext NOT NULL,
  `Value` tinytext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `Contact`
--

INSERT INTO `Contact` (`Type`, `Value`) VALUES
('Tel', '2310998930'),
('Email', 'pms_info@csd.auth.gr'),
('Fax', '2310998419');

-- --------------------------------------------------------

--
-- Table structure for table `Courses`
--

CREATE TABLE `Courses` (
  `Name` tinytext NOT NULL,
  `id` tinytext NOT NULL,
  `Professors` text NOT NULL,
  `Subject` text NOT NULL,
  `Weekly` tinyint(4) NOT NULL,
  `Type` enum('ΥΕ','Υ','Ε','ΠΠ') NOT NULL,
  `ECTS` float NOT NULL,
  `Semester` enum('1','2') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `Courses`
--

INSERT INTO `Courses` (`Name`, `id`, `Professors`, `Subject`, `Weekly`, `Type`, `ECTS`, `Semester`) VALUES
('Διαδίκτυο των Αντικειμένων', 'IHST102', 'Παναγιώτης Κατσαρός', 'Αρχιτεκτονική συστημάτων IoT (συσκευές, gateways, cloud, εφαρμογές) - Περιβάλλον ολοκλήρωσης τεχνολογιών IoT - Προγραμματισμός εφαρμογών IoT (Representational State Transfer, Message Queuing Telemetry Transport, Constrained Application Protocol) - Προγραμματισμός πλατφόρμας IoT - Σχεδίαση IoT gateway (αναπαράσταση και διασύνδεση δεδομένων) - Προγραμματισμός συσκευών IoT (αισθητήρες, συσκευές δράσης, έλεγχος) - Μεγάλα δεδομένα και ανάλυση - Μοντέλο ασφάλειας IoT.', 3, 'Υ', 7.5, '1'),
('Αλληλεπίδραση Ανθρώπου- Υπολογιστή ', 'IHST103', 'Χρήστος Κατσάνος', 'Το μάθημα καλύπτει ένα ευρύ φάσμα θεμάτων που σχετίζονται με τη σχεδίαση και αξιολόγηση διαδραστικών τεχνολογιών. Ιδιαίτερη έμφαση δίνεται σε μεθόδους έρευνας στο επιστημονικό πεδίο της Αλληλεπίδρασης Ανθρώπου-Υπολογιστή (Human-Computer Interaction, HCI) καθώς και στη συλλογή, ανάλυση και παρουσίαση δεδομένων εμπειρίας χρήσης (User Experience, UX) διαδραστικών συστημάτων.', 3, 'Υ', 7.5, '1'),
('Συνεργατικές Τεχνολογίες', 'IHST104', 'Σταύρος Δημητριάδης , Θρασύβουλος-Κωνσταντίνος Τσιάτσος', '', 3, 'Υ', 7.5, '1'),
('Μεθοδολογία Επιστημονικής Έρευνας', 'IHST105', 'Ελευθέριος Αγγελής , Παναγιώτης Κατσαρός , Νικόλαος Κονοφάος', 'Διάλεξη 1: Ακαδημαϊκός χώρος και έρευνα. Σύγχρονες μέθοδοι εκπαίδευσης και έρευνας στα πανεπιστήμια. Kύκλοι σπουδών (βασικός, μεταπτυχιακός, διδακτορικός), παραδείγματα από τον ελληνικό και διεθνή χώρο. Ο ρόλος των ακαδημαϊκών στην έρευνα. Οργάνωση έρευνας και ανάπτυξης σε μεγάλους οργανισμούς, ερευνητικά κέντρα και βιομηχανίες. Σύνδεση έρευνας-παραγωγής, οικονομικοί και κοινωνικοί παράγοντες που επηρεάζουν την έρευνα.  Διάλεξη 2: Έρευνα βασισμένη στα δεδομένα. Μορφές και παράσταση δεδομένων, λογισμικό ανάλυσης δεδομένων. Διάλεξη 3: Περιγραφική στατιστική Διάλεξη 4: Έλεγχοι υποθέσεων Διάλεξη 5: Πολυμεταβλητή στατιστική  Διάλεξη 6: Προσεγγίσεις επιστημονικών θεμάτων. Προσέγγιση «από πάνω προς τα κάτω» (top-down) και «από κάτω προς τα επάνω» (bottom-up). Ολιστική και κατανεμημένη σχεδίαση συστημάτων και διατάξεων. Παραδείγματα από τον χώρο της πληροφορικής και των επικοινωνιών. Αναφορά σε σύγχρονες μεθόδους ανάπτυξης συστημάτων (πχ συσχεδίαση υλικού/λογισμικού). Εξοικονόμιση κλίμακας.  Διάλεξη 7: Πειράματα και ανάλυσή τους. Χρήση συσκευών, προετοιμασία, διαδικασίες και πρότυπα (στάνταρντ). Εκτέλεση πειραμάτων, δειγματοληψία, μετρήσεις, ανάλυση και στατιστική επεξεργασία αποτελεσμάτων, εξαγωγή συμπερασμάτων. Θέματα ηθικής κατά την εκτέλεση πειραμάτων. Διάλεξη 8: Τεχνικές ελέγχου και επιβεβαίωσης (testing and verification). Εξομοιώσεις και προσομοιώσεις. Εργαλεία προσομοίωσης, δυνατότητες και χρήση. Εφαρμογές σε θέματα πληροφορικής όπως προσομοιώσεις υλικού (hardware) και σχεδίασης συστημάτων.  Διάλεξη 9: Θεωρήματα και αποδείξεις στην Επιστήμη των Υπολογιστών. Βασικές έννοιες τυπικής λογικής (γλώσσα, ερμηνεία, εγκυρότητα). Βασικές έννοιες Θεωρίας Συνόλων. Εργαστηριακή άσκηση με το λογισμικό ελέγχου αποδείξεων Coq. Διάλεξη 10: Θεμελιώσεις προτασιακής λογικής. Συστήματα συναγωγής συμπερασμάτων (inference) προτασιακής λογικής. Εργαστηριακή άσκηση με το λογισμικό ελέγχου αποδείξεων Coq.  Διάλεξη 11: Κατηγορηματική λογική. Εγκυρότητα και συναγωγή συμπερασμάτων. Εργαστηριακή άσκηση με το λογισμικό ελέγχου αποδείξεων Coq.  Διάλεξη 12: Αποδείξεις ορθότητας προγραμμάτων και αλγορίθμων. Εργαστηριακή άσκηση με το λογισμικό ελέγχου αποδείξεων Coq.  Διάλεξη 13: Βιβλιογραφική επισκόπηση', 3, 'Υ', 7.5, '1'),
('Τεχνολογία Λογισμικού', 'NCO-05-05', 'Ιωάννης Σταμέλος', 'Περιγραφή και ανάλυση των προβλημάτων της σημερινής βιομηχανίας παραγωγής λογισμικού. Λογισμικό Ανοικτού Κώδικα. Ευέλικτες Μέθοδοι. Διαδικασίες παραγωγής λογισμικού. Μοντέλα κύκλου ζωής λογισμικού. Εξαγωγή και Συγγραφή Απαιτήσεων. Προσεγγίσεις Ανάλυσης και Δομημένη Ανάλυση. Προσεγγίσεις Σχεδίασης και Δομημένη Σχεδίαση. Κωδικοποίηση και Έλεγχος. Εργαλεία και Περιβάλλοντα Τεχνολογίας Λογισμικού. Εργασία με συμμετοχή σε έργο Λογισμικού Ανοικτού Κώδικα.', 4, 'ΠΠ', 4, '1'),
('Εικονική Πραγματικότητα', 'DMCI205', 'Νικόλαος Νικολαΐδης', 'Ιστορική αναδρομή. Συσκευές παρακολούθησης κίνησης, συσκευές πλοήγησης σε εικονικά περιβάλλοντα. Αρχές οπτικού συστήματος ανθρώπου, στερέοψη. Οπτικές συσκευές εξόδου. Ανθρώπινη ακοή και αντίληψη της θέσης ηχητικής πηγής. Δημιουργία τρισδιάστατου ηχητικού πεδίου. Συσκευές ανάδρασης αφής και δύναμης. Μοντελοποίηση φυσικών ιδιοτήτων, απτική απεικόνιση, απτική υφή, υπολογισμός δύναμης ανάδρασης. Καταγραφή και επεξεργασία δεδομένων κίνησης. Διαχείριση μεγάλων γεωμετρικών μοντέλων, Level of Detail, κατάτμηση σε κελιά. Τεχνικές απλοποίησης και υποδιαίρεσης τριγωνικού πλέγματος. Ιεραρχικές δομές χωρικών δεδομένων και εφαρμογές τους στην εικονική πραγματικότητα. Επιτάχυνση απεικόνισης με χρήση τεχνικών culling. Επαυξημένη πραγματικότητα (κατηγοριοποίηση τεχνικών, εφαρμογές, συσκευες, παρακολούθηση κίνησης για επυαξημένη πραγματικότητα). Ανάπτυξη εφαρμογών εικονικής πραγματικότητας με χρήση Unreal Engine ή Unity.', 3, 'Ε', 7.5, '2'),
('Ανοιχτές Τεχνολογίες Υλικού και Λογισμικού', 'IHST101', 'Ιωάννης Σταμέλος', 'Εισαγωγή στην ανοικτότητα, διακυβέρνηση ανοικτών έργων, δομή ανοικτών κοινοτήτων, αξιολόγηση ανοικτών έργων, εργαλεία μέτρησης ανοικτού κώδικα, εργασία με συμμετοχή σε ανοικτό έργο. Εργαστήριο arduino και Raspberry Pi.', 3, 'Ε', 7.5, '2'),
('Ασφάλεια στο Διαδίκτυο των Αντικειμένων', 'IHST201', 'Παναγιώτης Κατσαρός', 'Απειλές, ευπάθειες και κίνδυνοι. Επιθέσεις και αντίμετρα. Επιθέσεις στο IoT. Σχεδίαση συστήματος με ασφάλεια. Ο κύκλος ζωής ενός ασφαλούς συστήματος IoT. Η κρυπτογραφία και ο ρόλος της στην ασφάλεια του IoT. Αρχές συστατικών κρυπτογραφίας. Θεμελιώσεις διαχείρισης κρυτπογραφικών κλειδιών. Κρυπτογραφικοί έλεγχοι για πρωτόκολλα IoT. Εισαγωγή στη διαχείριση ταυτοποιήσης και δικαιωμάτων προσπέλασης (IAM) για το IoT - Ο κύκλος ζωής μιας ταυτότητας, Πιστοποιητικά ελέγχου ταυτότητας, Υποδομή IAM στο IoT, Εξουσιοδότηση και έλεγχος προσπέλασης. Προκλήσεις ιδιωτικότητας στο IoT. Εκτίμηση επιπτώσεων (μη) ιδιωτικότητας στο IoT. Αρχές σχεδίασης με ιδιωτικότητα. Ασφάλεια νεφοϋπολογιστικής υποδομής για το IoT.', 3, 'ΥΕ', 7.5, '2'),
('Τεχνικές Βελτιστοποίησης', 'IHST202', 'Νικόλαος Τσίτσας', 'Εισαγωγή και κίνητρα μελέτης με παραδείγματα και εφαρμογές: >Βασική θεωρία και μέθοδοι για την επίλυση προβλημάτων βελτιστοποίησης >Το γενικό πρόβλημα βελτιστοποίησης  Βελτιστοποίηση χωρίς περιορισμούς: >Αναγκαίες συνθήκες 1ης και 2ας τάξεως, ικανές συνθήκες βελτίστου για προβλήματα ελαχιστοποίησης >Κριτήρια αναγνώρισης τοπικών βελτιστοποιητών  Μέθοδοι αναζήτησης ευθείας: >Γενικός αναδρομικός αλγόριθμος βελτιστοποίησης >Κατευθυνομένη παράγωγος και κατευθύνσεις καθόδου >Μέθοδοι Steepest Descent και Newton  Βελτιστοποίηση με περιορισμούς: >Προβλήματα βελτιστοποίησης με ισοτικούς περιορισμούς--Αναγκαίες και ικανές συνθήκες βελτίστου – Παραδείγματα >Προβλήματα βελτιστοποίησης με ανισοτικούς περιορισμούς--ΚΚΤ Συνθήκες – Παραδείγματα  Τεχνικές Εξελικτικής Βελτιστοποίησης: >Γενετικοί Αλγόριθμοι >Τεχνικές Βελτιστοποίησης Σμήνους Σωματιδίων >Αnt Colony System >Eφαρμογές (TSP)  Πλέγματα: >Εισαγωγή στα πλέγματα >Shortest vector, Closest vector problem >Αλγόριθμος LLL  >Αλγόριθμος Babai >Εφαρμογές (subset sum problem) >Κρυπτανάλυση με χρήση αλγορίθμων βελτιστοποίησης στα κρυπτοσυστήματα RSA και ψηφιακή υπογραφή (EC)DSA', 3, 'ΥΕ', 7.5, '2'),
('Συσχεδίαση Υλικού και Λογισμικού', 'IHST203', 'Νικόλαος Κονοφάος', '', 3, 'ΥΕ', 7.5, '2'),
('Φορητές και κινητές τεχνολογίες', 'IHST204', 'Χρήστος Κατσάνος , Διονύσιος Πολίτης', '', 3, 'ΥΕ', 7.5, '2'),
('Διοίκηση Έργων Πληροφορικής', 'IHST206', 'Ιωάννης Σταμέλος', 'Εισαγωγή, σχεδιασμός, χρονοπρογραμματισμός έργων. Διαχείριση κινδύνων, διασφάλιση ποιότητας, μοντέλα αξιολόγησης διεργασιών παραγωγής λογισμικού (CMMI). Αντιπρότυπα διοίκησης έργων. Μέθοδοι εκτίμησης κόστους λογισμικού, παραμετρικά μοντέλα (COCOMO), μοντέλα παλινδρόμησης, πιθανοκρατικά μοντέλα, μέθοδοι βασισμένες στην κρίση τών ειδικών. Ανάλυση βαθμών λειτουργίας. Τεχνικές και εργαλεία διοίκησης έργων Πληροφορικής.', 3, 'ΥΕ', 7.5, '2'),
('Ανάλυση Δεδομένων Μάθησης', 'IHST207', 'Σταύρος Δημητριάδης', '', 3, 'ΥΕ', 7.5, '2'),
('Σοβαρά παιχνίδια', 'IHST208', 'Θρασύβουλος-Κωνσταντίνος Τσιάτσος\r\nΚοινό	', 'Το μάθημα εστιάζει στην κατανόηση της έννοιας των Σοβαρών Παιχνιδιών (Serious Games - SG), καθώς και της επίδρασης που έχει η χρήση τους. Επιπλέον ασχολείται με θέματα σχεδίασης, ανάπτυξης και αξιολόγησης SG.  Στη Θεωρία εξετάζει θέματα όπως:  - Έννοια των SG - Θέματα σχεδίασης SG - Προσεγγίσεις δημιουργίας SG - Δημιουργία περιεχομένου - Games Engines - Προσωποποίηση και προσαρμογή  - Πολυχρηστικά παιχνίδια - Εμπειρία του παίκτη (Player experience) - Αποτίμηση απόδοσης  - Οικονομικές και νομικές διαστάσεις - Παραδείγματα παιχνιδιών   Στην Πρακτική εστιάζει σε:  - Πλατφόρμες ανάπτυξης SG - Unity  - Fungus', 3, 'ΥΕ', 7.5, '2'),
('Ενσωματωμένα και κυβερνοφυσικά συστήματα', 'IHST209', 'Παναγιώτης Κατσαρός', 'Εισαγωγή στα Κυβερνο-φυσικά συστήματα, Συνεχή δυναμικά συστήματα, Διακριτά δυναμικά συστήματα, Υβριδικά συστήματα, Σύνθεση Μηχανών Πεπερασμένων Καταστάσεων, Μοντέλα Υπολογισμού για Ταυτοχρονισμό, Αισθητήρες και Συσκευές Δράσης, Ενσωματωμένοι επεξεργαστές, Αρχιτεκτονικές μνήμης, Είσοδος & έξοδος, Πολυδιεργασία, Χρονοπρογραμματισμός, Ανάλυση προσεγγισιμότητας και έλεγχος μοντέλων, Ποσοτική ανάλυση, Ασφάλεια και ιδιωτικότητα.', 3, 'Ε', 7.5, '2');

-- --------------------------------------------------------

--
-- Table structure for table `Professors`
--

CREATE TABLE `Professors` (
  `Name` text NOT NULL,
  `Surname` text NOT NULL,
  `Academic Email` text NOT NULL,
  `Subject` longtext NOT NULL,
  `Rank` enum('Λέκτορας','Επίκουρος Καθηγητής','Αναπληρωτής Καθηγητής','Καθηγητής','Ομότιμος Καθηγητής') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `Professors`
--

INSERT INTO `Professors` (`Name`, `Surname`, `Academic Email`, `Subject`, `Rank`) VALUES
('Σταύρος', 'Δημητριάδης', 'sdemetri@csd.auth.gr', 'Python, Δισακτική', 'Αναπληρωτής Καθηγητής'),
('Ελευθέριος', 'Αγγελής', 'lef@csd.auth.gr', 'Βέλτιστοι πειραματικοί και δειγματοληπτικοί σχεδιασμοί\r\nΑνθεκτικοί Εκτιμητές\r\nΣτατιστικές μέθοδοι στην τεχνολογία λογισμικού:\r\nΕκτίμηση κόστους, μελέτη του σφάλματος σε μοντέλα πρόβλεψης κόστους, εκτίμηση ελλειπουσών τιμών σε μοντέλα κόστους, μεθοδολογίες σύγκρισης μοντέλων πρόβλεψης κόστους και μελέτη φάσεων έργων λογισμικού\r\nΜοντέλα διάγνωσης σφαλμάτων λογισμικού\r\nΔιαδικασίες ανάπτυξης λογισμικού ανοικτού κώδικα\r\nΕλεγχόμενα πειράματα και έρευνες για τη μελέτη του ανθρώπινου παράγοντα (προσωπικότητα, συμπεριφορά, προτιμήσεις, μαθησιακά εργαλεία, προγραμματιστικές πρακτικές, επιδόσεις) στην ανάπτυξη λογισμικού\r\nΠροτεραιότητες απαιτήσεων και ζητημάτων στην τεχνολογία λογισμικού μέσω συστημάτων ψηφοφορίας\r\nΣτατιστικές μέθοδοι στην ανακάλυψη γνώσης από δεδομένα παγκόσμιου Ιστού, κατανεμημένες βάσεις δεδομένων και βιοιατρικά κείμενα, μέθοδοι συσταδοποίησης και κατηγοριοποίησης και αιτιοκρατικά μοντέλα πολυμεταβλητών βιοιατρικών δεδομένων\r\nΠροσομοίωση συστημάτων και στατιστικές μέθοδοι στην προσομοίωση\r\nΚρυπτογραφική μετατροπή δεδομένων\r\nΣτατιστικές μέθοδοι στη διαχείριση δεξιοτήτων ανθρώπινου δυναμικού\r\nΣτατιστικές μέθοδοι στις ευπάθειες πληροφοριακών συστημάτων\r\nΣτατιστική ανάλυση δεδομένων σε ιατρικές μελέτες\r\nΑναλύσεις δεδομένων από έρευνες και πειράματα –μελέτες', 'Καθηγητής'),
('Κωνσταντίνος', 'Δραζιώτης', 'drazioti@csd.auth.gr', '', 'Επίκουρος Καθηγητής'),
('Χρήστος', 'Κατσάνος', 'ckatsanos@csd.auth.gr', 'Αλληλεπίδραση Ανθρώπου-Υπολογιστή\r\nΑλληλεπίδραση Ανθρώπου-Ρομπότ\r\nΕπιστήμη του Ιστού\r\nΠροσβασιμότητα Διαδικτύου\r\nΕκπαιδευτικές τεχνολογίες\r\nΜέθοδοι και εργαλεία σχεδιασμού και αξιολόγησης διαδραστικών συστημάτων λογισμικού', 'Επίκουρος Καθηγητής'),
('Παναγιώτης', 'Κατσαρός', 'katsaros@csd.auth.gr', 'Τυπικές Μέθοδοι Ανάλυσης Συστημάτων\r\nΑξιοπιστία και Ασφάλεια Λογισμικού\r\nΤεχνολογία Λογισμικού\r\nΣυστήματα Διαστημικής & Internet Of Things', 'Αναπληρωτής Καθηγητής'),
('Νίκος', 'Κονοφάος', 'nkonofao@csd.auth.gr', 'Μικρο- και Νανο- ηλεκτρονικές διατάξεις και κυκλώματα.\r\nΣχεδίαση και προσομοίωση κυκλωμάτων VLSI στην νανο-κλίμακα.\r\nΚβαντικές υπολογιστικές διατάξεις και κυκλώματα.\r\nΟπτοηλεκτρονική: Διατάξεις ημιαγωγών, κυκλώματα και αισθητήρες.', 'Αναπληρωτής Καθηγητής'),
('Διονύσιος', 'Πολίτης', 'dpolitis@csd.auth.gr', '', 'Επίκουρος Καθηγητής'),
('Ιωάννης', 'Σταμέλος', 'stamelos@csd.auth.gr', 'Τεχνολογία Λογισμικού\r\nΛογισμικό Ανοικτού Κώδικα\r\nΕκτίμηση Κόστους και Ποιότητας Λογισμικού\r\nΔιοίκηση Έργων Λογισμικού\r\nΕυέλικτες Μέθοδοι\r\nΠληροφοριακά Συστήματα Επιχειρήσεων', 'Καθηγητής'),
('Θρασύβουλος-Κων/νος', 'Τσιάτσος', 'tsiatsos@csd.auth.gr', 'Δικτυακά εικονικά περιβάλλοντα μάθησης\r\nΕκπαιδευτική χρήση πολυμέσων και τεχνολογιών διαδικτύου\r\nΑνοικτή και εξ’ αποστάσεως εκπαίδευση με χρήση δικτύων υπολογιστών και πρωτοκόλλων πραγματικού χρόνου', 'Επίκουρος Καθηγητής'),
('Νικόλαος', 'Τσίτσας', 'ntsitsas@csd.auth.gr', 'Αναλυτικές και αριθμητικές μέθοδοι ευθείας και αντίστροφης κυματικής σκέδασης και διάδοσης\r\nΑριθμητικές τεχνικές επίλυσης ολοκληρωτικών και μερικών διαφορικών εξισώσεων\r\nΜέθοδοι βελτιστοποίησης', 'Επίκουρος Καθηγητής');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
